VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/long_target100k_Re160/01_openfoam_setup/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          0.001;

adjustTimeStep  yes;

maxCo           0.9;

writeControl    runTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ( forces );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         ( cylinder );
        rho             rhoInf;
        rhoInf          1.205;
        CofR            ( 0 0 0 );
        liftDir         ( 0 1 0 );
        dragDir         ( 1 0 0 );
        pitchAxis       ( 0 0 1 );
        magUInf         0.202133;
        lRef            0.012;
        Aref            0.00012;
    }
    residuals
    {
        type            solverInfo;
        libs            ( utilityFunctionObjects );
        fields          ( U p );
        writeControl    timeStep;
        writeInterval   1;
    }
    CourantNo
    {
        type            CourantNo;
        libs            ( fieldFunctionObjects );
        writeControl    writeTime;
    }
}


// ************************************************************************* //
