VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/long_target100k_Re160/01_openfoam_setup/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.120000 -0.012000 -0.005000)
    (0.360000 -0.012000 -0.005000)
    (0.360000 0.012000 -0.005000)
    (-0.120000 0.012000 -0.005000)
    (-0.120000 -0.012000 0.005000)
    (0.360000 -0.012000 0.005000)
    (0.360000 0.012000 0.005000)
    (-0.120000 0.012000 0.005000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (218 12 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    bottom
    {
        type wall;
        faces ((0 1 5 4));
    }
    top
    {
        type wall;
        faces ((3 7 6 2));
    }
    front
    {
        type empty;
        faces ((0 3 2 1));
    }
    back
    {
        type empty;
        faces ((4 5 6 7));
    }
);

mergePatchPairs ();
