VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/long_target100k_Re160/01_openfoam_setup/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.202133333 0 0);

boundaryField
{
    inlet
    {
        type exprFixedValue;
        valueExpr "vector(0.202133333*(1.0 - pow(2.0*pos().y()/0.024000000, 2.0)), 0, 0)";
        value uniform (0 0 0);
    }
    outlet { type zeroGradient; }
    top { type noSlip; }
    bottom { type noSlip; }
    cylinder { type noSlip; }
    front { type empty; }
    back { type empty; }
}
